- **Python** 
    - variable - storing data
    - data type - int float string - string **list dictunary** set range
    - sunctions - create reusable code, lot's of lines of code in one place
    - classes - helt us containerise code, box things up,

- **Libraries** 
    - numpy - **array** we can create matrices, numerical calculation
    - panda - **DataFrames** store data like spread sheets, sexcel sheets, we can manipulate those table

- **Machine Learning**
    - data
    - feed to the machines
    - show the machines what is right, what is wrong (learn, creates its own pattern)
    - then you ask questions, and get answers

### dictinary
- we will try to create a dictionary
- datatype with keys and values

In [ ]:
# create a small dictionary
#names of 4 students, and their marks
# key : value

In [ ]:
my_dict = {
    "Name":"Adam", "Marks":65,
    "Name":"Wong", "Marks":90,
    "Name":"Ranjit", "Marks":70}

print(my_dict)

{'Name': 'Ranjit', 'Marks': 70}

In [7]:
students = {
    "Adam" : 65,
    "Wong" : 90,
    "Ranjit" : 70,
    "Rahim" : 80
}
print(students)

# access elements
students["Rahim"]

{'Adam': 65, 'Wong': 90, 'Ranjit': 70, 'Rahim': 80}

80

In [ ]:
student_grades = {
    "Name": ["Adam","Wong","Ranjit","Rahim","Ali","Azam"],
    "Maths": [65,90,70,80,98,76],
    "English": [86,85,75,85,67,87],
    "Science": [85,58,79,87,87,78]
}
print(student_grades)

{'Name': ['Adam', 'Wong', 'Ranjit', 'Rahim', 'Ali', 'Azam'], 'Maths': [65, 90, 70, 80, 98, 76], 'English': [86, 85, 75, 85, 67, 87], 'Science': [85, 58, 79, 87, 87, 78]}

In [12]:
student_grades["Name"]

student_grades["Name"][0]

'Adam'

In [ ]:
# pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp314-cp314-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\roaming\python\python314\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\roaming\python\python314\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp314-cp314-win_amd64.whl (11.1 MB)
   ---------------------------------------- 0.0/11.1 MB ? eta -:--:--
   --- ------------------------------------ 1.0/11.1 MB 5.0 MB/s eta 0:00:03
   --------- ------------------------------ 2.6/11.1 MB 6.1 MB/s eta 0:00:02
   ----------------- ---------------------- 5.0/11.1 MB 8.1 MB/s eta 0:00:01
   ----------------------------- ---------- 8.1/11.1 MB 9.8 MB/s eta 0:00:01
   ---------------------------------------  11.0/11.1 MB 10.9 MB/s eta 0:00:01
   ---------------------------------------- 11.1/11.1 MB 10.6 MB/s  0:00:01
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas

   ---------------------------------------- 0/3 [pytz]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   ---------------------------------------- 3/3 [pandas]

Successfully installed pandas-2.3.3 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [33]:
import pandas as pd
df = pd.DataFrame(student_grades)
df

     Name  Maths  English  Science
0    Adam     65       86       85
1    Wong     90       85       58
2  Ranjit     70       75       79
3   Rahim     80       85       87
4     Ali     98       67       87
5    Azam     76       87       78

In [34]:
print("\n First Table .............",df,"\n")
print("\n Second Table .............",df,"\n")
print("\n Third Table .............",df,"\n")

 First Table .............      Name  Maths  English  Science
0    Adam     65       86       85
1    Wong     90       85       58
2  Ranjit     70       75       79
3   Rahim     80       85       87
4     Ali     98       67       87
5    Azam     76       87       78


 Second Table .............      Name  Maths  English  Science
0    Adam     65       86       85
1    Wong     90       85       58
2  Ranjit     70       75       79
3   Rahim     80       85       87
4     Ali     98       67       87
5    Azam     76       87       78


 Third Table .............      Name  Maths  English  Science
0    Adam     65       86       85
1    Wong     90       85       58
2  Ranjit     70       75       79
3   Rahim     80       85       87
4     Ali     98       67       87
5    Azam     76       87       78

In [35]:
type(df)

# numpy.ndarray

pandas.core.frame.DataFrame

In [38]:
# head is top part of a df # 5 is the defult argrument
df.tail()

     Name  Maths  English  Science
1    Wong     90       85       58
2  Ranjit     70       75       79
3   Rahim     80       85       87
4     Ali     98       67       87
5    Azam     76       87       78

In [39]:
df.head(3)

     Name  Maths  English  Science
0    Adam     65       86       85
1    Wong     90       85       58
2  Ranjit     70       75       79

In [ ]:
# we can access certain column in dataframe too

In [47]:
df["Maths"]

0    65
1    90
2    70
3    80
4    98
5    76
Name: Maths, dtype: int64

In [44]:
student_grades["Maths"]

[65, 90, 70, 80, 98, 76]

In [50]:
print("\n Names Column .............\n",df["Name"])
print("\n English Column .............\n",df["English"])

 Names Column .............
 0      Adam
1      Wong
2    Ranjit
3     Rahim
4       Ali
5      Azam
Name: Name, dtype: object

 English Column .............
 0    86
1    85
2    75
3    85
4    67
5    87
Name: English, dtype: int64

In [57]:
# series

marks_series = pd.Series([1,2,3,4,5,6])
#type(marks_series)

print(marks_series)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [56]:
import numpy as np
arrayyy = np.array([])
type(arrayyy)

numpy.ndarray

In [58]:
df

     Name  Maths  English  Science
0    Adam     65       86       85
1    Wong     90       85       58
2  Ranjit     70       75       79
3   Rahim     80       85       87
4     Ali     98       67       87
5    Azam     76       87       78

In [62]:
student_grades["English"][4]

67

In [60]:
print("Marks Ali for subject English is \t",df.English[4])

Marks Ali for subject English is 	 67

In [ ]:
#english_ali= df["English"]
#print("In english Ali had 67 marks")


print(f"In English {df.Name[2]} had {df.English[2]} marks")

In English Ranjit had 75 marks

In [66]:
rn = df["Name"][2]
eng_Wong = df["English"][2]

print(f"In English {rn} had {eng_Wong} marks")

In English Ranjit had 75 marks

In [67]:
rn = df["Name"][2]
Mat_Wong = df["Maths"][2]

print(f"In Maths {rn} had {Mat_Wong} marks")

In Maths Ranjit had 70 marks

# core data types we use in pandas?


# create a series of data pd.series 5 values of tempreture

dataframes city and temreture - 5 cities

In [6]:
cities_tempreture = {
    "City": ["Kuala Lumpur","Singapore","Jakarta","Delhi","Beijing"],
    "Tempreture": [30,27,31,23,10],
}
print(cities_tempreture)

{'City': ['Kuala Lumpur', 'Singapore', 'Jakarta', 'Delhi', 'Beijing'], 'Tempreture': [30, 27, 31, 23, 10]}

In [7]:
import pandas as pd
temp_df = pd.DataFrame(cities_tempreture)
temp_df

           City  Tempreture
0  Kuala Lumpur          30
1     Singapore          27
2       Jakarta          31
3         Delhi          23
4       Beijing          10

In [8]:
print(type(temp_df))

temp_series = pd.Series([30,27,31,23,10])
print(type(temp_series))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [9]:
# series object - single column, 1s column
temp11 = pd.Series([23,20,25,19,-2])
print("Type of temp11",type(temp11))

tempreture = {
    "city": ["Kuala Lumpur","Singapore","Jakarta","Delhi","Beijing"],
    "temp10": [30,27,31,23,10],
}

tempe_df = pd.DataFrame(tempreture)
print("Type of temp_df",type(tempe_df))

print(tempe_df)
print(temp11)

# tempe_df ---------> add day11 to this as well

Type of temp11 <class 'pandas.core.series.Series'>
Type of temp_df <class 'pandas.core.frame.DataFrame'>
           city  temp10
0  Kuala Lumpur      30
1     Singapore      27
2       Jakarta      31
3         Delhi      23
4       Beijing      10
0    23
1    20
2    25
3    19
4    -2
dtype: int64

In [138]:
tempe_df

           city  temp10
0  Kuala Lumpur      30
1     Singapore      27
2       Jakarta      31
3         Delhi      23
4       Beijing      10

In [10]:
# dataframe creates a column that does not exis
tempe_df["temp11"] = temp11
tempe_df

           city  temp10  temp11
0  Kuala Lumpur      30      23
1     Singapore      27      20
2       Jakarta      31      25
3         Delhi      23      19
4       Beijing      10      -2

In [11]:
temp12 = pd.Series([25,24,27,21,5])
tempe_df["temp12"] = temp12
tempe_df

           city  temp10  temp11  temp12
0  Kuala Lumpur      30      23      25
1     Singapore      27      20      24
2       Jakarta      31      25      27
3         Delhi      23      19      21
4       Beijing      10      -2       5

In [12]:
tempe_df["new_temp"] = pd.Series([31,29,32,35,5])
tempe_df

           city  temp10  temp11  temp12  new_temp
0  Kuala Lumpur      30      23      25        31
1     Singapore      27      20      24        29
2       Jakarta      31      25      27        32
3         Delhi      23      19      21        35
4       Beijing      10      -2       5         5

In [119]:
tempe_df["city"] = {}
tempe_df

  city  temp10
0  NaN      30
1  NaN      27
2  NaN      31
3  NaN      23
4  NaN      10

In [13]:
tempe_df["MelRating"] = {}
tempe_df

           city  temp10  temp11  temp12  new_temp MelRating
0  Kuala Lumpur      30      23      25        31       NaN
1     Singapore      27      20      24        29       NaN
2       Jakarta      31      25      27        32       NaN
3         Delhi      23      19      21        35       NaN
4       Beijing      10      -2       5         5       NaN

In [14]:
tempe_df["IbrahimRating"] = {}
tempe_df

           city  temp10  temp11  temp12  new_temp MelRating IbrahimRating
0  Kuala Lumpur      30      23      25        31       NaN           NaN
1     Singapore      27      20      24        29       NaN           NaN
2       Jakarta      31      25      27        32       NaN           NaN
3         Delhi      23      19      21        35       NaN           NaN
4       Beijing      10      -2       5         5       NaN           NaN

In [15]:
tempe_df["IbrahimRating"] = pd.Series([5,2,6,5,4])

In [16]:
tempe_df["MelRating"] = pd.Series([1,2,4,5,3])

In [17]:
tempe_df

           city  temp10  temp11  temp12  new_temp  MelRating  IbrahimRating
0  Kuala Lumpur      30      23      25        31          1              5
1     Singapore      27      20      24        29          2              2
2       Jakarta      31      25      27        32          4              6
3         Delhi      23      19      21        35          5              5
4       Beijing      10      -2       5         5          3              4

In [18]:
# already a dataset?
# save this as csv file??

tempe_df.to_csv("City Rating without Row Numbers.csv", index=False)

In [19]:
tempe_df["city"].value_counts()

city
Kuala Lumpur    1
Singapore       1
Jakarta         1
Delhi           1
Beijing         1
Name: count, dtype: int64

In [ ]:
#if you have a repetetion it going to return 1 name
# mel,mel,mel,ibram,ibram,ail,ali,ali
tempe_df["city"].unique()

array(['Kuala Lumpur', 'Singapore', 'Jakarta', 'Delhi', 'Beijing'],
      dtype=object)

In [ ]:
 tempe_df["city"].duplicated()

0    False
1    False
2    False
3    False
4    False
Name: city, dtype: bool

In [22]:
data = {
    "cities": ["Kuala Lumpur","Singapore","Jakarta","Jakarta","Beijing"],
    "temp10": [30,27,31,23,10],
}

df = pd.DataFrame(data)
df

         cities  temp10
0  Kuala Lumpur      30
1     Singapore      27
2       Jakarta      31
3       Jakarta      23
4       Beijing      10

In [24]:
df["cities"].value_counts()

cities
Jakarta         2
Kuala Lumpur    1
Singapore       1
Beijing         1
Name: count, dtype: int64

In [25]:
df["cities"].unique()

array(['Kuala Lumpur', 'Singapore', 'Jakarta', 'Beijing'], dtype=object)

In [33]:
# it shows false if not if not duplicate, and show true if it have duplicate
df["cities"].duplicated()

0    False
1    False
2    False
3     True
4    False
Name: cities, dtype: bool

In [35]:
df2 = df["cities"].drop_duplicates()
df2

0    Kuala Lumpur
1       Singapore
2         Jakarta
4         Beijing
Name: cities, dtype: object